In [2]:
import pandas as pd
import numpy as np

In [3]:
from sqlalchemy import create_engine

In [4]:
temp_db = create_engine('sqlite:///:memory:')

In [6]:
df = pd.DataFrame(data = np.random.randint(low=0,high=100,size=(4,4)),columns=['a','b','c','d'])

In [7]:
df

    a   b   c   d
0  67  46  74  82
1  75  56  32  51
2  56  60  43  28
3   0  12  99  79

In [9]:
df.to_sql(name = 'new_table',con=temp_db)

4

In [10]:
df.to_sql(name = 'new_table',con=temp_db)

ValueError: Table 'new_table' already exists.

In [11]:
new_df = pd.read_sql(sql='new_table',con=temp_db)

In [12]:
new_df

   index   a   b   c   d
0      0  67  46  74  82
1      1  75  56  32  51
2      2  56  60  43  28
3      3   0  12  99  79

In [13]:
result = pd.read_sql_query(sql='SELECT a,c FROM new_table',con=temp_db)

In [14]:
result

    a   c
0  67  74
1  75  32
2  56  43
3   0  99